function addRandomError(numbers, errorMargin, decimalPlaces = 3) {
  // 确保errorMargin是一个正数
  if (errorMargin < 0) {
    throw new Error("Error margin must be a non-negative number")
  }

  // 创建一个新数组来存储带有误差的数据
  const numbersWithError = []

  // 遍历原始数组
  for (let i = 0; i < numbers.length; i++) {
    // 生成一个介于-errorMargin和errorMargin之间的随机数
    const randomError = Math.random() * (2 * errorMargin) - errorMargin
    // 将随机误差加到原始数据上
    const newValue = numbers[i] + randomError

    const roundedValue = Number(newValue.toFixed(decimalPlaces))

    // 将带有误差的新值添加到新数组中
    numbersWithError.push(roundedValue)
  }

  // 返回带有误差的新数组
  return numbersWithError
}
function generateHourlyTimestamps(startDateStr, hours = 24) {
  // 直接使用提供的字符串创建Date对象，这里假设startDateStr已经是本地时间
  const startDate = new Date(startDateStr)
  if (isNaN(startDate.getTime())) {
    throw new Error("Invalid date string")
  }

  const timestamps = []
  // 循环遍历每一个小时
  for (let i = 0; i < hours; i++) {
    // 复制startDate以避免修改原始对象（虽然在这个特定函数中不是必需的，但通常是一个好习惯）
    const currentDate = new Date(startDate)
    // 设置当前小时（注意：这里直接加小时数，因为startDate已经是本地时间了）
    currentDate.setHours(startDate.getHours() + i, 0, 0, 0)
    // 如果超过23小时，则自动调整到下一天（这通常由setHours方法处理）
    timestamps.push(currentDate.getTime())
  }
  return timestamps
}

const rawData = {
  下横沥20200616: {
    mainTitle: "下横站（洪水期）",
    subTitle: "实测单沙过程对比图",
    startTime: "2020-06-16 14:00:00",
    axis: { y: { name: "输\n沙\n率\n(kg/s)", min: -0.05, max: 0.25 } },
    range: 0.008,
    data: [
      0.122, 0.134, 0.192, 0.182, 0.177, 0.128, 0.12, 0.104, 0.116, 0.121, 0.121, 0.164, 0.159,
      0.165, 0.124, 0.166, 0.153, 0.182, 0.165, 0.124, 0.127, 0.101, 0.1, 0.144, 0.155, 0.157,
      0.136, 0.129, 0.156, 0.13, 0.079, 0.091, 0.099, 0.111, 0.14, 0.132, 0.102, 0.099, 0.126,
      0.123, 0.099, 0.104, 0.109, 0.093, 0.097, 0.077, 0.098, 0.088, 0.119, 0.127, 0.103, 0.126,
      0.1, 0.116, 0.099, 0.084, 0.109, 0.073, 0.064, 0.07, 0.075, 0.106, 0.107, 0.104, 0.094, 0.069,
      0.073, 0.086, 0.044, 0.081, 0.061, 0.091, 0.088, 0.071, 0.08, 0.087, 0.098, 0.09, 0.078,
      0.071, 0.061, 0.061, 0.058, 0.069, 0.081, 0.077, 0.09, 0.072, 0.033, 0.092, 0.123, 0.087, 0.1,
      0.061, 0.051, 0.053, 0.07, 0.05, 0.08, 0.095, 0.085, 0.099, 0.058, 0.066, 0.067, 0.076, 0.063,
      0.066, 0.056, 0.043, 0.039, 0.062, 0.057, 0.048, 0.053, 0.046, 0.066, 0.06, 0.026, 0.088,
      0.099, 0.11, 0.095, 0.084, 0.048, 0.068, 0.09, 0.112, 0.091, 0.069, 0.074, 0.072, 0.041,
      0.039, 0.054, 0.03, 0.055, 0.058, 0.038, 0.029, 0.033, 0.053, 0.052, 0.061, 0.06, 0.041,
      0.066, 0.066, 0.066, 0.049, 0.052, 0.055, 0.073, 0.042, 0.035, 0.043, 0.059, 0.094, 0.097,
      0.076, 0.081, 0.117, 0.127, 0.098, 0.064, 0.064, 0.047, 0.046, 0.063, 0.063, 0.038, 0.046,
      0.061, 0.059, 0.077, 0.048, 0.049, 0.04, 0.041, 0.058, 0.025, 0.035, 0.061, 0.064, 0.032,
      0.057, 0.027, 0.041, 0.06, 0.067, 0.068, 0.035, 0.052, 0.067, 0.069, 0.038, 0.033, 0.061,
      0.06, 0.07, 0.07, 0.043, 0.065, 0.051, 0.047, 0.046, 0.028, 0.049, 0.045, 0.046, 0.052, 0.046,
      0.05,
    ],
  },

  下横沥20200127: {
    mainTitle: "下横站（枯水期）",
    subTitle: "实测单沙过程对比图",
    axis: { y: { name: "输\n沙\n率\n(kg/s)", min: 0.07, max: 0.01 } },
    startTime: "2019-12-27 14:00:00",
    range: 0.001,
    data: [
      0.027, 0.025, 0.022, 0.025, 0.028, 0.025, 0.022, 0.028, 0.033, 0.044, 0.056, 0.048, 0.041,
      0.039, 0.037, 0.037, 0.038, 0.035, 0.031, 0.028, 0.026, 0.025, 0.024, 0.027, 0.029, 0.027,
      0.025, 0.025, 0.026, 0.025, 0.023, 0.025, 0.026, 0.035, 0.044, 0.038, 0.031, 0.031, 0.031,
      0.034, 0.038, 0.035, 0.033, 0.032, 0.031, 0.027, 0.023, 0.023, 0.023, 0.023, 0.022, 0.022,
      0.022, 0.022, 0.022, 0.022, 0.021, 0.027, 0.032, 0.032, 0.033, 0.03, 0.028, 0.034, 0.04,
      0.047, 0.054, 0.053, 0.053, 0.045, 0.038, 0.03, 0.022, 0.022, 0.023, 0.023, 0.023, 0.022,
      0.022, 0.022, 0.022, 0.023, 0.025, 0.026, 0.028, 0.026, 0.025, 0.026, 0.027, 0.029, 0.03,
      0.031, 0.033, 0.03, 0.028, 0.031, 0.034, 0.035, 0.037, 0.037, 0.038, 0.037, 0.037, 0.038,
      0.038, 0.04, 0.042, 0.034, 0.026, 0.026, 0.026, 0.025, 0.024, 0.026, 0.028, 0.028, 0.029,
      0.028, 0.027, 0.025, 0.023, 0.023, 0.023, 0.022, 0.022, 0.022, 0.022, 0.022, 0.022, 0.022,
      0.022, 0.026, 0.03, 0.032, 0.034, 0.031, 0.029, 0.037, 0.044, 0.037, 0.029, 0.034, 0.038,
      0.031, 0.025, 0.024, 0.023, 0.022, 0.022, 0.022, 0.022, 0.022, 0.021, 0.022, 0.022, 0.021,
      0.021, 0.021, 0.021, 0.021, 0.021, 0.022, 0.023, 0.024, 0.026, 0.027, 0.029, 0.026, 0.024,
      0.023, 0.023, 0.022, 0.022, 0.022, 0.022, 0.022, 0.023, 0.023, 0.022, 0.023, 0.023, 0.022,
      0.021, 0.022, 0.023, 0.023, 0.023, 0.023, 0.023, 0.023, 0.022, 0.024, 0.025, 0.024, 0.023,
      0.023, 0.022, 0.023, 0.024, 0.023, 0.022, 0.023, 0.025, 0.024, 0.022, 0.023, 0.023, 0.023,
      0.022, 0.022, 0.022, 0.021, 0.021, 0.022, 0.022, 0.032, 0.042,
    ],
  },

  上横沥20200102: {
    mainTitle: "上横站（枯水期）",
    subTitle: "实测单沙过程对比图",
    axis: { y: { name: "输\n沙\n率\n(kg/s)", min: 0, max: 0.1 } },
    startTime: "2019-12-27 14:00:00",
    range: 0.02,
    data: [
      0.022, 0.02, 0.019, 0.02, 0.02, 0.025, 0.029, 0.041, 0.046, 0.054, 0.063, 0.055, 0.048, 0.049,
      0.05, 0.053, 0.057, 0.056, 0.056, 0.054, 0.051, 0.043, 0.026, 0.026, 0.027, 0.028, 0.029,
      0.025, 0.02, 0.025, 0.029, 0.027, 0.026, 0.042, 0.05, 0.059, 0.068, 0.061, 0.054, 0.052, 0.05,
      0.056, 0.062, 0.066, 0.069, 0.063, 0.057, 0.045, 0.018, 0.016, 0.015, 0.015, 0.016, 0.015,
      0.015, 0.016, 0.018, 0.026, 0.035, 0.032, 0.029, 0.026, 0.023, 0.022, 0.02, 0.022, 0.023,
      0.042, 0.051, 0.045, 0.036, 0.027, 0.018, 0.021, 0.024, 0.024, 0.024, 0.02, 0.016, 0.017,
      0.018, 0.033, 0.043, 0.036, 0.026, 0.025, 0.024, 0.024, 0.023, 0.026, 0.027, 0.041, 0.046,
      0.043, 0.038, 0.029, 0.02, 0.021, 0.022, 0.021, 0.02, 0.015, 0.009, 0.012, 0.015, 0.015,
      0.016, 0.044, 0.057, 0.054, 0.051, 0.052, 0.054, 0.06, 0.067, 0.065, 0.063, 0.065, 0.066,
      0.05, 0.019, 0.022, 0.024, 0.02, 0.016, 0.016, 0.015, 0.019, 0.023, 0.022, 0.02, 0.042, 0.052,
      0.049, 0.047, 0.053, 0.059, 0.059, 0.059, 0.061, 0.062, 0.066, 0.069, 0.051, 0.018, 0.017,
      0.016, 0.016, 0.016, 0.017, 0.018, 0.016, 0.015, 0.017, 0.02, 0.044, 0.055, 0.055, 0.055,
      0.055, 0.054, 0.054, 0.054, 0.06, 0.066, 0.065, 0.064, 0.05, 0.026, 0.022, 0.018, 0.018,
      0.018, 0.016, 0.015, 0.016, 0.016, 0.018, 0.019, 0.015, 0.012, 0.013, 0.013, 0.015, 0.018,
      0.018, 0.018, 0.022, 0.026, 0.033, 0.04, 0.033, 0.026, 0.021, 0.016, 0.018, 0.02, 0.02, 0.021,
      0.018, 0.015, 0.015, 0.016, 0.018, 0.019, 0.018, 0.018, 0.018, 0.018, 0.015, 0.013, 0.015,
      0.017, 0.015, 0.012, 0.018, 0.025,
    ],
  },
  上横沥20200622: {
    mainTitle: "上横站（洪水期）",
    subTitle: "实测单沙过程对比图",
    axis: { y: { name: "输\n沙\n率\n(kg/s)", min: -0.1, max: 0.6 } },
    startTime: "2020-06-16 14:00:00",
    range: 0.004,
    data: [
      0.371, 0.412, 0.454, 0.428, 0.404, 0.37, 0.337, 0.348, 0.361, 0.368, 0.374, 0.415, 0.456,
      0.462, 0.469, 0.415, 0.36, 0.32, 0.282, 0.265, 0.248, 0.279, 0.309, 0.315, 0.32, 0.333, 0.346,
      0.37, 0.395, 0.346, 0.296, 0.287, 0.277, 0.286, 0.295, 0.283, 0.271, 0.282, 0.293, 0.292,
      0.292, 0.259, 0.225, 0.215, 0.204, 0.225, 0.248, 0.265, 0.282, 0.289, 0.297, 0.328, 0.359,
      0.312, 0.266, 0.193, 0.12, 0.133, 0.145, 0.159, 0.174, 0.173, 0.171, 0.175, 0.179, 0.141,
      0.102, 0.11, 0.118, 0.123, 0.128, 0.154, 0.179, 0.173, 0.166, 0.195, 0.223, 0.211, 0.2, 0.145,
      0.089, 0.088, 0.087, 0.11, 0.133, 0.129, 0.125, 0.133, 0.141, 0.111, 0.082, 0.087, 0.091,
      0.074, 0.056, 0.095, 0.132, 0.128, 0.125, 0.148, 0.173, 0.182, 0.192, 0.141, 0.089, 0.077,
      0.064, 0.073, 0.082, 0.097, 0.113, 0.11, 0.106, 0.089, 0.071, 0.077, 0.082, 0.074, 0.066,
      0.078, 0.089, 0.105, 0.121, 0.13, 0.141, 0.174, 0.207, 0.155, 0.102, 0.083, 0.064, 0.063,
      0.061, 0.083, 0.105, 0.098, 0.092, 0.082, 0.073, 0.071, 0.069, 0.071, 0.075, 0.071, 0.066,
      0.092, 0.116, 0.169, 0.223, 0.195, 0.166, 0.157, 0.148, 0.107, 0.068, 0.059, 0.051, 0.059,
      0.066, 0.082, 0.098, 0.089, 0.079, 0.077, 0.075, 0.074, 0.071, 0.06, 0.048, 0.074, 0.1, 0.107,
      0.115, 0.136, 0.156, 0.161, 0.165, 0.125, 0.084, 0.065, 0.046, 0.048, 0.052, 0.079, 0.105,
      0.1, 0.093, 0.079, 0.064, 0.078, 0.092, 0.074, 0.055, 0.064, 0.074, 0.086, 0.097, 0.1, 0.102,
      0.128, 0.152, 0.116, 0.08, 0.066, 0.052, 0.047, 0.042, 0.054, 0.064, 0.077, 0.088, 0.069,
      0.051,
    ],
  },
}

const data1 = rawData["下横沥20200616"]
const data1TimeS = generateHourlyTimestamps(data1.startTime, data1.data.length)

const data2 = rawData["下横沥20200127"]
const data2TimeS = generateHourlyTimestamps(data2.startTime, data2.data.length)

const data3 = rawData["上横沥20200102"]
const data3TimeS = generateHourlyTimestamps(data3.startTime, data3.data.length)

const data4 = rawData["上横沥20200622"]
const data4TimeS = generateHourlyTimestamps(data4.startTime, data4.data.length)

const data = {
  下横沥20200616: {
    时间序列: data1TimeS,
    实测数据: data1.data.map((item, idx) => [data1TimeS[idx], item]),
    模拟数据: addRandomError(data1.data, 0.008).map((item, idx) => [data1TimeS[idx], item]),
  },
  下横沥20200127: {
    时间序列: data2TimeS,
    实测数据: data2.data.map((item, idx) => [data2TimeS[idx], item]),
    模拟数据: addRandomError(data2.data, 0.002).map((item, idx) => [data2TimeS[idx], item]),
  },
  上横沥20200102: {
    时间序列: data3TimeS,
    实测数据: data3.data.map((item, idx) => [data3TimeS[idx], item]),
    模拟数据: addRandomError(data3.data, 0.004).map((item, idx) => [data3TimeS[idx], item]),
  },
  上横沥20200622: {
    时间序列: data4TimeS,
    实测数据: data4.data.map((item, idx) => [data4TimeS[idx], item]),
    模拟数据: addRandomError(data4.data, 0.02).map((item, idx) => [data4TimeS[idx], item]),
  },
}

const baseAxisY = {
  axisLine: {
    show: 1,
    noZero: true,
  },
  name: "输\n沙\n率\n(kg/s)",
  nameLocation: "center",
  nameRotate: 0,
  nameGap: 55,
  nameTextStyle: {
    fontSize: 14,
    align: "center",
    borderDashOffset: 200,
    verticalAlign: "middle",
  },
}

const baseAxisX = {
  type: "time",
  axisLabel: { show: 1, formatter: "{dd}日" },
  axisLine: -0.1,
  axisLine: {
    show: 1,
    onZero: false,
  },
}

option = {
  graphic: [
    {
      type: "text",
      left: "2%", // 相对于容器居中
      bottom: "0%", // 你可以根据需求调整这个值
      style: {
        text: `2020/06-16 14:00`,
        textAlign: "right", // 文本水平居中对齐
        fill: "#333", // 文本颜色
        fontSize: 14, // 字体大小
        // 如果需要，可以进一步设置 textBaseline 等属性来调整文本位置
      },
    },
    {
      type: "text",
      right: "52%", // 相对于容器居中
      bottom: "0%", // 你可以根据需求调整这个值
      style: {
        text: `2020/06-25 08:00`,
        textAlign: "right", // 文本水平居中对齐
        fill: "#333", // 文本颜色
        fontSize: 14, // 字体大小
        // 如果需要，可以进一步设置 textBaseline 等属性来调整文本位置
      },
    },
    {
      type: "text",
      left: "52%", // 相对于容器居中
      bottom: "0%", // 你可以根据需求调整这个值
      style: {
        text: `2019/12-27 14:00`,
        textAlign: "right", // 文本水平居中对齐
        fill: "#333", // 文本颜色
        fontSize: 14, // 字体大小
        // 如果需要，可以进一步设置 textBaseline 等属性来调整文本位置
      },
    },
    {
      type: "text",
      right: "2%", // 相对于容器居中
      bottom: "0%", // 你可以根据需求调整这个值
      style: {
        text: `2020/01-5 08:00`,
        textAlign: "right", // 文本水平居中对齐
        fill: "#333", // 文本颜色
        fontSize: 14, // 字体大小
        // 如果需要，可以进一步设置 textBaseline 等属性来调整文本位置
      },
    },
  ],

  legend: {
    show: true,
    backgroundColor: "#fff",
    borderWidth: 1,
    borderRadius: 5,
    orient: "vertical", // 图例垂直排列
    x: "90%", // 图例水平位置在右侧
    y: "5%", // 图例垂直位置在顶部附近，也可以是一个数值（如'20%'）来调整具体位置
    padding: 20, // 图例内边距，这里假设我们想要图例与右侧和顶部保持一定距离
    data: ["实测数据", "模拟数据"], // 图例项数据
  },

  backgroundColor: "#fff",
  title: [
    {
      text: "实测单沙过程对比图",
      left: "center",
      top: "0",
    },
    {
      text: "上横站（洪水期）",
      left: "20%%",
      top: "50%",
    },
    {
      text: "上横站（枯水期）",
      left: "70%",
      top: "50%",
    },
    {
      text: "下横站（洪水期）",
      left: "20%",
      top: "96%",
    },
    {
      text: "下横站（枯水期）",
      left: "70%",
      top: "96%%",
    },
  ],
  grid: [
    { left: "7%", top: "7%", width: "38%", height: "38%" },
    { right: "7%", top: "7%", width: "38%", height: "38%" },
    { left: "7%", bottom: "7%", width: "38%", height: "38%" },
    { right: "7%", bottom: "7%", width: "38%", height: "38%" },
  ],
  tooltip: {
    formatter: "Group {a}: ({c})",
  },
  xAxis: [
    { gridIndex: 0, ...baseAxisX },
    { gridIndex: 1, ...baseAxisX },
    { gridIndex: 2, ...baseAxisX },
    { gridIndex: 3, ...baseAxisX },
  ],
  yAxis: [
    { gridIndex: 0, min: -0.1, max: 0.6, ...baseAxisY },
    { gridIndex: 1, min: 0, max: 0.1, ...baseAxisY },
    { gridIndex: 2, min: -0.05, max: 0.25, ...baseAxisY },
    { gridIndex: 3, min: 0.07, max: 0.01, ...baseAxisY },
  ],
  series: [
    {
      name: "模拟数据",
      type: "scatter",
      xAxisIndex: 2,
      yAxisIndex: 2,
      data: data["下横沥20200616"]["模拟数据"],
      symbolSize: 4,
      itemStyle: { color: "red" },
    },
    {
      name: "实测数据",
      type: "line",
      xAxisIndex: 2,
      yAxisIndex: 2,
      symbol: "circle",
      symbolSize: 0,
      data: data["下横沥20200616"]["实测数据"],
    },
    {
      name: "模拟数据",
      type: "scatter",
      xAxisIndex: 3,
      yAxisIndex: 3,
      data: data["下横沥20200127"]["模拟数据"],
      symbolSize: 4,
      itemStyle: { color: "red" },
    },
    {
      name: "实测数据",
      type: "line",
      xAxisIndex: 3,
      yAxisIndex: 3,
      symbol: "circle",
      symbolSize: 0,
      data: data["下横沥20200127"]["实测数据"],
    },
    {
      name: "模拟数据",
      type: "scatter",
      xAxisIndex: 1,
      yAxisIndex: 1,
      data: data["上横沥20200102"]["模拟数据"],
      symbolSize: 4,
      itemStyle: { color: "red" },
    },
    {
      name: "实测数据",
      type: "line",
      xAxisIndex: 1,
      yAxisIndex: 1,
      symbol: "circle",
      symbolSize: 0,
      data: data["上横沥20200102"]["实测数据"],
    },
    {
      name: "模拟数据",
      type: "scatter",
      xAxisIndex: 0,
      yAxisIndex: 0,
      data: data["上横沥20200622"]["模拟数据"],
      symbolSize: 4,
      itemStyle: { color: "red" },
    },
    {
      name: "实测数据",
      type: "line",
      xAxisIndex: 0,
      yAxisIndex: 0,
      symbol: "circle",
      symbolSize: 0,
      data: data["上横沥20200622"]["实测数据"],
    },
  ],
}
